public class Array_1 {
  public static void main(String[] args) {
    //배열도 자료형!!!!!!!!! - 참조 자료형임@!!!!!
    //배열의 선언 및 생성

    //정수를 여러 개 저장할 수 있는 배열을 선언
    // 배열의 선언 : 자료형 변수명; ->기본자료형이랑 같음!
    //int 배열 : int[] -> []사용!, []까지 자료형임!!!!!!!!!!!
    int[] arr1;

    //배열의 생성 (5개의 정수를 저장할 수 있는 배열 arr1을 생성)
    //정수형 배열은 생성시 0으로 생성
    arr1 = new int[5];

    //실수를 여러 개 저장할 수 있는 배열 arr2를 선언
    double[] arr2;

    //실수를 3개 저장할 수 있는 arr2 배열의 생성
    //실수형 배열은 생성 시 0.0으로 초기화
    arr2 = new double[3];

    //배열 선언 : 빈 땅에 아파트 지을거야 선언
    //배열 생성 : 같은 땅에 아파트 생성함.
    //배열의 요소 : 공간 하나하나 -> '0' 부터 시작


    //문자열 5개를 저장할 수 있는 배열 arr3 선언 및 생성
    //기본자료형을 제외한 모든 배열은 생성 시 'null'로 초기화
    //null - 빈 값, 데이터 없음. 문자열 아님!!
    String[] arr3 = new String[5];






  }
}
